# Python and pandas recap

In [1]:
#For loops
for x in range(10):
    print(x)

0
1
2
3
4
5
6
7
8
9

In [3]:
#While loops
a = 5

while a > 2:
    print(a)
    a -= 1  #other option: a = a-1
    print(a)
    print("moving on")

5
4
moving on
4
3
moving on
3
2
moving on

In [5]:
numbers = [1, 2, 3, 4]

[num ** 2 for num in numbers]

[1, 4, 9, 16]

In [7]:
[x for x in range(10) if x % 2 == 0]

[0, 2, 4, 6, 8]

In [9]:
"Danielle"[2]

'n'

In [11]:
word = "Danielle"
vowels = "aeiou"
[char for char in word if char in vowels]

['a', 'i', 'e', 'e']

In [13]:
#it's simpler to take care of the data. for this case if you ask AI how to dedup the previous code you get something much more complicated than just deduping the data
word_deduped = list(set(word))
word_deduped

['n', 'i', 'l', 'a', 'D', 'e']

In [15]:
[char for char in word_deduped if char in vowels]

['i', 'a', 'e']

In [ ]:
{'a': 1, 'b': 2, 'c': 3}

In [17]:
def divides_by_three(num):
    if num % 3 == 0:
        return True
    else:
        return False

#alternative:
def divides_by_three(num):
    return num % 3 == 0

In [19]:
divides_by_three(-4)

False

In [21]:
my_list = [1, 4, 6, 7, 9, 9, 9]

for x in my_list:
    if divides_by_three(x) and x%2==0:
        print(x)

6

In [23]:
for x in my_list:
    if divides_by_three(x) or x%2==0:
        print(x)

4
6
9
9
9

In [25]:
import pandas as pd
import numpy as np

In [27]:
df = pd.read_excel(r'C:\Users\ydool\Downloads\Data Operations Job Title Taxonomy Versioned.xlsx', sheet_name='master v1')

In [28]:
df.head(2)

,alias,canonical_title,parent_title,title_definition,function,function_ISO-8K-150,is_generic,is_people_manager,is_active,alias_company,alias_time_stamp,comment
0,ai linguist,AI Linguist,Language Data Analyst,NaN,Data Operations Management,Data Administrator,NaN,NaN,yes,NaN,NaT,NaN
1,ai operations manager,AI Operations Manager,Data Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,NaN,NaT,NaN

In [31]:
df.sample(4)

,alias,canonical_title,parent_title,title_definition,function,function_ISO-8K-150,is_generic,is_people_manager,is_active,alias_company,alias_time_stamp,comment
31,data application specialist,Data Application Specialist,NaN,NaN,NaN,NaN,NaN,NaN,yes,NaN,NaT,NaN
75,data processing specialist,Data Processing Specialist,NaN,NaN,Data Labeling,Data Technician,NaN,NaN,yes,NaN,NaT,NaN
55,annotation team manager,Data Labeling Team Lead,Data Operations Manager,NaN,Data Operations Management,Data Manager,NaN,yes,yes,NaN,2024-12-16,NaN
7,catalog specialist,Catalog Specialist,NaN,NaN,Data Labeling,Data Technician,NaN,NaN,yes,NaN,NaT,NaN

In [33]:
df['rand_number'] = np.random.randint(1, 101, size=len(df))

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 136 entries, 0 to 135
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   alias                136 non-null    object
 1   canonical_title      136 non-null    object
 2   parent_title         83 non-null     object
 3   title_definition     0 non-null      float64
 4   function             125 non-null    object
 5   function_ISO-8K-150  125 non-null    object
 6   is_generic           17 non-null     object
 7   is_people_manager    30 non-null     object
 8   is_active            136 non-null    object
 9   alias_company        20 non-null     object
 10  alias_time_stamp     20 non-null     datetime64[ns]
 11  comment              5 non-null      object
 12  rand_number          136 non-null    int32
dtypes: datetime64[ns](1), float64(1), int32(1), object(10)
memory usage: 13.4+ KB

In [37]:
df['rand_number'].max()

100

In [41]:
df[df.index.isin([1,2,3])][['alias', 'function', 'is_active']]

                     alias                    function is_active
1    ai operations manager  Data Operations Management       yes
2       ai project manager  Data Operations Management       yes
3  ai solutions specialist  Data Operations Management       yes

In [45]:
df[df['alias'].str.startswith('ai')].head(3)

,alias,canonical_title,parent_title,title_definition,function,function_ISO-8K-150,is_generic,is_people_manager,is_active,alias_company,alias_time_stamp,comment,rand_number
0,ai linguist,AI Linguist,Language Data Analyst,NaN,Data Operations Management,Data Administrator,NaN,NaN,yes,NaN,NaT,NaN,59
1,ai operations manager,AI Operations Manager,Data Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,NaN,NaT,NaN,88
2,ai project manager,AI Project Manager,AI Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,NaN,NaT,NaN,57

In [47]:
df.groupby('parent_title')['rand_number'].mean().reset_index()

                  parent_title  rand_number
0        AI Operations Manager    33.500000
1   Data Annotation Specialist    39.000000
2   Data Collection Specialist    71.000000
3               Data Collector    78.000000
4               Data Evaluator    52.000000
5                 Data Labeler    74.777778
6      Data Labeling Team Lead     5.000000
7                 Data Manager    60.000000
8      Data Operations Manager    50.120000
9              Data QA Manager    40.000000
10        Data Quality Manager    49.333333
11             Data Specialist    64.333333
12          Knowledge Engineer    14.000000
13       Language Data Analyst    45.750000
14                    Linguist    42.000000
15        Quality Data Analyst    48.000000
16                  Taxonomist    45.000000

In [49]:
df.sort_values(by='parent_title')

,alias,canonical_title,parent_title,title_definition,function,function_ISO-8K-150,is_generic,is_people_manager,is_active,alias_company,alias_time_stamp,comment,rand_number
2,ai project manager,AI Project Manager,AI Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,NaN,NaT,NaN,57
127,human data project manager,Human Data Project Manager,AI Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,NaN,2025-03-29,NaN,10
11,clinical analyst,Clinical Data Analyst,Data Annotation Specialist,NaN,Data Labeling,Data Technician,NaN,NaN,yes,NaN,NaT,NaN,60
12,clinical data analyst,Clinical Data Analyst,Data Annotation Specialist,NaN,Data Labeling,Data Technician,NaN,NaN,yes,NaN,2024-08-10,NaN,18
135,data collection qa,Data Collection QA,Data Collection Specialist,NaN,Data Labeling,Data Technician,NaN,NaN,yes,NaN,2025-03-29,NaN,71
...,...,...,...,...,...,...,...,...,...,...,...,...,...
115,quality operations team lead,Quality Operations Team Lead,NaN,NaN,Data Operations Management,Data Manager,NaN,yes,yes,NaN,NaT,NaN,76
117,research assistant,Research Assistant,NaN,NaN,Data Labeling,Data Technician,yes,NaN,yes,NaN,NaT,NaN,83
118,search evaluation lead,Search Evaluation Lead,NaN,NaN,Data Operations Management,Data Manager,NaN,yes,yes,FIVERR,NaT,NaN,45
125,customer success manager,Customer Success Manager,NaN,NaN,NaN,NaN,NaN,NaN,no,NaN,NaT,NaN,17
131,ai specialist,AI Solutions Specialist,NaN,NaN,Data Operations Management,Data Administrator,yes,NaN,yes,NaN,2025-03-29,NaN,54

In [51]:
df['parent_title'].nunique()

17

In [53]:
df['parent_title'].unique()

array(['Language Data Analyst', 'Data Operations Manager',
       'AI Operations Manager', nan, 'Data Labeler',
       'Quality Data Analyst', 'Data Annotation Specialist',
       'Data Evaluator', 'Data Labeling Team Lead', 'Data Manager',
       'Data Specialist', 'Data Quality Manager', 'Data QA Manager',
       'Linguist', 'Data Collector', 'Knowledge Engineer', 'Taxonomist',
       'Data Collection Specialist'], dtype=object)

In [55]:
df['parent_title'].value_counts()

parent_title
Data Operations Manager       25
Quality Data Analyst          17
Data Labeler                   9
Taxonomist                     5
Language Data Analyst          4
Data Evaluator                 4
Data Quality Manager           3
Data Specialist                3
Data Manager                   3
Data Annotation Specialist     2
AI Operations Manager          2
Data Labeling Team Lead        1
Data QA Manager                1
Linguist                       1
Data Collector                 1
Knowledge Engineer             1
Data Collection Specialist     1
Name: count, dtype: int64

In [59]:
df.fillna("default", inplace=True)

C:\Users\ydool\AppData\Local\Temp\ipykernel_1268\4135641796.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'default' has dtype incompatible with datetime64[ns], please explicitly cast to a compatible dtype first.
  df.fillna("default", inplace=True)
C:\Users\ydool\AppData\Local\Temp\ipykernel_1268\4135641796.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'default' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.fillna("default", inplace=True)

In [61]:
df1 = df.groupby(['parent_title', 'function'])['rand_number'].sum().reset_index()
df1.head(2)

                 parent_title                    function  rand_number
0       AI Operations Manager  Data Operations Management           67
1  Data Annotation Specialist               Data Labeling           78

In [76]:
df2 = df.groupby(['canonical_title', 'function'])['rand_number'].sum().reset_index()
df2 = df2[df2['function'] != 'Data Operations Management'].copy()
df2.head(2)

              canonical_title       function  rand_number
5     Annotated Data Reviewer  Data Labeling          100
6  Catalog Content Specialist  Data Labeling           70

In [78]:
df1.rename(columns = {'rand_number': 'rand1'}, inplace=True)
df2.rename(columns = {'rand_number': 'rand2'}, inplace=True)

In [80]:
df1.merge(df2, how='left', on='function')

,parent_title,function,rand1,canonical_title,rand2
0,AI Operations Manager,Data Operations Management,67,NaN,NaN
1,Data Annotation Specialist,Data Labeling,78,Annotated Data Reviewer,100.0
2,Data Annotation Specialist,Data Labeling,78,Catalog Content Specialist,70.0
3,Data Annotation Specialist,Data Labeling,78,Catalog Specialist,33.0
4,Data Annotation Specialist,Data Labeling,78,Classification Specialist,75.0
...,...,...,...,...,...
182,default,default,397,Data Operator,96.0
183,default,default,397,Data Optimization,77.0
184,default,default,397,Data Specialist,75.0
185,default,default,397,Operational Specialist,20.0
186,default,default,397,Procurement Data Specialist And Content Expert,85.0

In [82]:
df1.merge(df2, how='right', on='function')

,parent_title,function,rand1,canonical_title,rand2
0,Data Annotation Specialist,Data Labeling,78,Annotated Data Reviewer,100
1,Data Collection Specialist,Data Labeling,71,Annotated Data Reviewer,100
2,Data Collector,Data Labeling,78,Annotated Data Reviewer,100
3,Data Evaluator,Data Labeling,85,Annotated Data Reviewer,100
4,Data Labeler,Data Labeling,673,Annotated Data Reviewer,100
...,...,...,...,...,...
169,Data Collector,Data Labeling,78,Research Assistant,83
170,Data Evaluator,Data Labeling,85,Research Assistant,83
171,Data Labeler,Data Labeling,673,Research Assistant,83
172,Quality Data Analyst,Data Labeling,33,Research Assistant,83
173,default,Data Labeling,720,Research Assistant,83

# Jupyter Notebook deep dive

In [85]:
3+4

7

# Project Kickoff

* Explanation of the project and the data
* Plan from here for the meetings

# Connecting SQL and Python

In [109]:
import sqlite3
import pandas as pd

conn = sqlite3.connect(r'C:\Users\ydool\Downloads\workshop_db.db')

In [111]:
pd.read_sql("select * from transactions limit 5", conn)

,product_id,date,customer_id,country,amount paid
0,06bfafe7-060d-4eb8-8e38-aaa2cbe9b99b,2022-06-11,d6ed0a21-dde6-4fe4-b933-f51309f9bb88,South Korea,1091.05
1,06bfafe7-060d-4eb8-8e38-aaa2cbe9b99b,2023-08-13,76dfc7e6-f2b6-427e-9ec3-740ee1f7f1ef,Japan,1091.05
2,06bfafe7-060d-4eb8-8e38-aaa2cbe9b99b,2023-06-04,f2ffa56f-ed49-42c7-8d19-b0a70edc9388,Canada,1091.05
3,06bfafe7-060d-4eb8-8e38-aaa2cbe9b99b,2023-12-09,2f33f25b-2d52-443c-95ec-a5ffe4bdc492,Australia,1091.05
4,06bfafe7-060d-4eb8-8e38-aaa2cbe9b99b,2025-03-30,305a43aa-3dc0-46e8-a896-62d5209afb3d,India,1091.05

In [113]:
trasactions = pd.read_sql("select * from transactions", conn)

In [115]:
trasactions

,product_id,date,customer_id,country,amount paid
0,06bfafe7-060d-4eb8-8e38-aaa2cbe9b99b,2022-06-11,d6ed0a21-dde6-4fe4-b933-f51309f9bb88,South Korea,1091.05
1,06bfafe7-060d-4eb8-8e38-aaa2cbe9b99b,2023-08-13,76dfc7e6-f2b6-427e-9ec3-740ee1f7f1ef,Japan,1091.05
2,06bfafe7-060d-4eb8-8e38-aaa2cbe9b99b,2023-06-04,f2ffa56f-ed49-42c7-8d19-b0a70edc9388,Canada,1091.05
3,06bfafe7-060d-4eb8-8e38-aaa2cbe9b99b,2023-12-09,2f33f25b-2d52-443c-95ec-a5ffe4bdc492,Australia,1091.05
4,06bfafe7-060d-4eb8-8e38-aaa2cbe9b99b,2025-03-30,305a43aa-3dc0-46e8-a896-62d5209afb3d,India,1091.05
...,...,...,...,...,...
82937,94e62898-6932-41e7-b110-4d5dfb929b00,2024-06-22,3601eb12-aeec-46f7-92f0-8ca35e2da749,France,1251.22
82938,94e62898-6932-41e7-b110-4d5dfb929b00,2025-08-14,9ac430d1-8ff5-43e4-b343-a59f54a9a197,USA,1251.22
82939,94e62898-6932-41e7-b110-4d5dfb929b00,2024-08-16,3775a642-bfd9-42c2-8bd0-c4d5626065d4,USA,1251.22
82940,94e62898-6932-41e7-b110-4d5dfb929b00,2022-12-26,931ef37a-6bfa-46c9-b349-548af87a54a9,UK,1251.22
82941,94e62898-6932-41e7-b110-4d5dfb929b00,2025-06-27,e874109c-2572-46be-9922-f3812bd39dc8,Italy,1251.22

In [117]:
pd.read_sql("SELECT name FROM sqlite_master WHERE type='table'", conn)

           name
0      products
1       reviews
2  transactions
3  labeled_data

In [119]:
pd.read_sql("select * from labeled_data limit 5", conn)

,review_id,product_id,review_text,brand,model,color,brand_mentioned,model_mentioned,color_mentioned,sentiment,sentiment_intensity,price_mentioned,competitor_mentioned,battery_life_mentioned,toxic_language,fake_sounding,dangerous_content
0,93541409-6a2e-42fc-9026-dc2feb6864a3,2b508863-a697-4531-a6c6-577da6710aeb,"""This Sony Xperia L4 White is an excellent pho...",Sony,Xperia L4,White,yes,no,yes,positive,no,yes,yes,yes,yes,yes,yes
1,dcb33646-0d13-4098-b115-8c44d4157cb4,3e4ce392-99f5-4a6f-834c-040f34e95bdf,"""The phone I recently acquired from the Google...",Google,Pixel 5a 5G,Green,yes,yes,no,positive,unclear,yes,yes,yes,yes,yes,yes
2,be18fb72-02ff-4faa-98d8-2079bc4425f9,eecb94c9-788c-4bc5-a638-e594a5109a5c,"Great value for the price, but some users have...",Huawei,Nova 5T,White,yes,yes,yes,positive,no,no,no,yes,no,no,yes
3,4c6bd9aa-a336-4ce4-a46e-2b7f495aa645,58b3cfd9-aa2f-41e0-9f95-92f92fdb5b15,"""I have had my hands on this phone for several...",OnePlus,OnePlus 10,Green,no,yes,no,positive,no,yes,yes,no,yes,no,yes
4,fe9c6c43-be39-4a90-b5f7-16a7818c7ed6,bc6a01cc-323f-4d58-80ad-9e1797716154,"""Not worth the money! The phone's specs seem i...",Oppo,Oppo A32,Black,no,yes,yes,negative,no,yes,no,no,yes,yes,yes

In [121]:
#Lets build a sent_for_labeling table
pd.read_sql("select review_id, product_id, current_date as date_sent, 'Danielle' as sender  from labeled_data", conn)

,review_id,product_id,date_sent,sender
0,93541409-6a2e-42fc-9026-dc2feb6864a3,2b508863-a697-4531-a6c6-577da6710aeb,2025-11-06,Danielle
1,dcb33646-0d13-4098-b115-8c44d4157cb4,3e4ce392-99f5-4a6f-834c-040f34e95bdf,2025-11-06,Danielle
2,be18fb72-02ff-4faa-98d8-2079bc4425f9,eecb94c9-788c-4bc5-a638-e594a5109a5c,2025-11-06,Danielle
3,4c6bd9aa-a336-4ce4-a46e-2b7f495aa645,58b3cfd9-aa2f-41e0-9f95-92f92fdb5b15,2025-11-06,Danielle
4,fe9c6c43-be39-4a90-b5f7-16a7818c7ed6,bc6a01cc-323f-4d58-80ad-9e1797716154,2025-11-06,Danielle
...,...,...,...,...
935,dcab3ff7-ecc4-40e5-8905-48c7bd2fc94c,4ad0f4c7-87c5-427b-ba6a-7791bebe9dcc,2025-11-06,Danielle
936,96a3ffb9-85be-4f41-b582-9fb2421519a1,a09b024d-38f4-4d5f-806c-77b3264a0b88,2025-11-06,Danielle
937,89bbaa91-71e2-48c3-89f4-3dc157e92983,d791cc10-06e2-4c11-b374-2b27cd3b89c0,2025-11-06,Danielle
938,6a171a88-e847-4271-adc7-511369a2b744,18a182d6-fc3d-4477-9b57-db160c289ba3,2025-11-06,Danielle
939,dc4e336c-b625-4131-9e59-89ed9e3e830c,bc8365a7-9c69-44ba-a686-9fc81034b957,2025-11-06,Danielle

In [123]:
sent_for_labeling = pd.read_sql("select review_id, product_id, current_date as date_sent, 'Danielle' as sender  from labeled_data", conn)

In [125]:
sent_for_labeling.to_sql('sent_for_labeling', conn, if_exists='replace', index=False)

940

In [127]:
pd.read_sql("select * from sent_for_labeling", conn)

,review_id,product_id,date_sent,sender
0,93541409-6a2e-42fc-9026-dc2feb6864a3,2b508863-a697-4531-a6c6-577da6710aeb,2025-11-06,Danielle
1,dcb33646-0d13-4098-b115-8c44d4157cb4,3e4ce392-99f5-4a6f-834c-040f34e95bdf,2025-11-06,Danielle
2,be18fb72-02ff-4faa-98d8-2079bc4425f9,eecb94c9-788c-4bc5-a638-e594a5109a5c,2025-11-06,Danielle
3,4c6bd9aa-a336-4ce4-a46e-2b7f495aa645,58b3cfd9-aa2f-41e0-9f95-92f92fdb5b15,2025-11-06,Danielle
4,fe9c6c43-be39-4a90-b5f7-16a7818c7ed6,bc6a01cc-323f-4d58-80ad-9e1797716154,2025-11-06,Danielle
...,...,...,...,...
935,dcab3ff7-ecc4-40e5-8905-48c7bd2fc94c,4ad0f4c7-87c5-427b-ba6a-7791bebe9dcc,2025-11-06,Danielle
936,96a3ffb9-85be-4f41-b582-9fb2421519a1,a09b024d-38f4-4d5f-806c-77b3264a0b88,2025-11-06,Danielle
937,89bbaa91-71e2-48c3-89f4-3dc157e92983,d791cc10-06e2-4c11-b374-2b27cd3b89c0,2025-11-06,Danielle
938,6a171a88-e847-4271-adc7-511369a2b744,18a182d6-fc3d-4477-9b57-db160c289ba3,2025-11-06,Danielle
939,dc4e336c-b625-4131-9e59-89ed9e3e830c,bc8365a7-9c69-44ba-a686-9fc81034b957,2025-11-06,Danielle

In [129]:
# example of join
pd.read_sql("""select p.product_id, brand, model, color, count(r.product_id)
from products  p
join reviews r on p.product_id=r.product_id
group by 1, 2, 3""", conn)

,product_id,brand,model,color,count(r.product_id)
0,000b63fe-bf6f-4a9b-ac49-208b3a882019,Oppo,Oppo A53,Green,6
1,001a870c-4bba-4bb7-80a7-5096ac5665a2,Huawei,P10,Blue,3
2,0033b260-a41a-4d22-aed8-ba7f37fdeff8,Samsung,Galaxy Note 9,Blue,6
3,003b48e7-41db-4d32-9185-1cf1210f8d5c,Google,Pixel 3 XL,Green,5
4,00539ecb-8c52-46fb-98a2-67e682786b9a,OnePlus,OnePlus 5,Blue,6
...,...,...,...,...,...
1995,ff476f77-7fea-4a28-9437-fad21a86e66a,OnePlus,OnePlus 7T,White,5
1996,ff5fd224-4156-42a7-b473-f5de417b095f,Apple,iPhone 12 Mini,Silver,2
1997,ff960eae-8ed2-4187-9c99-19e49a7b57ef,Samsung,Galaxy M42,Gold,8
1998,ffb6423f-9168-4b92-b9a9-e220095358b3,Sony,Xperia Z3+,Green,6
1999,ffc82533-8f2c-42f2-852d-46bdf98f3f84,Google,Pixel 1,Silver,6